using static System.Console;
Clear();

// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Write("Введите число А: ");
// int a = Convert.ToInt32(ReadLine()!);
// Write("Введите число B: ");
// int b = Convert.ToInt32(ReadLine()!);
// int c = a;


// for (int i = 1; i < b; i++)
// {
//     a = a * c;
// }
// Write(a);



// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12


// Random rnd = new Random();
// int a = rnd.Next(100, 999+1);
// WriteLine(a);

// int a1 = a/100; 
// WriteLine($"Первая цифра числа:{a1}");
// int a2 = a/10%10;
// WriteLine($"Вторая цифра числа: {a2}");
// int a3 = a%10;
// WriteLine($"Последняя цифра числа: {a3}");

// WriteLine($"Сумма цифр: {a1+a2+a3}");



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


// Random rnd = new Random();
// int[] a = new int[8];

// Write("[");
// for (int i = 0; i < a.Length; i++)
// {
//     a[i] = rnd.Next(0,9);
//     Write($"{a[i]} ");
// }
// Write("]");


